using System;
using System.Collections.Generic;
using System.Text;

namespace JT809.Protocol.Enums
{
    /// <summary>
    ///  报警类型
    /// </summary>
    public enum JT809WarnType : ushort
    {
        超速报警 = 0x0001,
        疲劳驾驶报警 = 0x0002,
        紧急报警 = 0x0003,
        进入指定区域报警 = 0x0004,
        离开指定区域报警 = 0x0005,
        越界报警 = 0x0008,
        盗警 = 0x0009,
        劫警 = 0x000A,
        偏离路线报警 = 0x000B,
        车辆移动报警 = 0x000C,
        超时驾驶报警 = 0x000D,
        违规行驶报警 = 0x0010,
        前撞报警 = 0x0011,
        车道偏离报警 = 0x0012,
        胎压异常报警 = 0x0013,
        动态信息异常报警 = 0x0014,
        其他报警 = 0x000E,

        超时停车=0xA001,
        车辆定位信息上报时间间隔异常 = 0xA002,
        车辆定位信息上报距离间隔异常 = 0xA003,
        下级平台异常断线 = 0xA004,
        下级平台数据传输异常 = 0xA005,
        路段堵塞报警 = 0xA006,
        危险路段报警 = 0xA007,
        雨雪天气报警 = 0xA008,
        驾驶员身份识别异常 = 0xA009,
        终端异常 = 0xA00A,
        平台接入异常 = 0xA00B,
        核心数据异常 = 0xA00C,
        其他报警1 = 0xA0FF,
    }
}
